Repository: tyandco/iEmirati
Catalog: iEmirati/Localizable.xcstrings
Source language: en
Languages: ar

source: About
ar: عن التطبيق

# aldissais
source: Al-Dissais (الدسيس)
ar: الدسيس

# aldissaisdesc
source: One of the most prominent traditional games in the UAE and the Arab world. Similar to hide-and-seek.
ar: واحدة من أبرز الألعاب التقليدية في دولة الإمارات العربية المتحدة والعالم العربي. مشابه للعبة الغميضة.

# aldissaisrules
source: The game requires the participation of three or more children, with one of them starting to search for the others. If they manage to catch one, they place their hand on their head to announce their victory.
ar: تتطلب اللعبة مشاركة ثلاثة أطفال أو أكثر، حيث يبدأ أحدهم في البحث عن الآخرين. إذا تمكنوا من الإمساك بواحد، فإنهم يضعون أيديهم على رؤوسهم للإعلان عن انتصارهم.

# alhosn
source: Qasr Al Hosn
ar: قصر الحصن

# alhosndesc
source: This is a historical landmark and the oldest stone building in the city of Abu Dhabi, the capital of the United Arab Emirates. Its construction was supervised by Mohammed Al Bastaki in 1761.
ar: هذا معلم تاريخي وأقدم مبنى حجري في مدينة أبو ظبي، عاصمة دولة الإمارات العربية المتحدة. أشرف على بنائه محمد البستكي في عام 1761.

source: also known as MayDreemurr on GitHub
ar: يعرف أيضا باسم MayDreemurr على GitHub

source: also known as S3eedMV1 on GitHub
ar: يعرف أيضا باسم S3eedMV1 على GitHub

source: also known as tyandco on GitHub
ar: يعرف أيضا باسم tyandco على GitHub

source: App Dev:
ar: مبرمج التطبيق:

# Arqoub
source: عرقوب (Arqoub)
ar: عرقوب

# Arqoub Example
source: This word can be used in a phrase, for example, you could say “Barga Arqoub”, which means “I’m going/driving up the plateau.”
ar: يمكن استخدام الكلمة في جملة، مثل: “برقى عرقوب”، والذي يعني “سأصعد الهضبة”.

# Arqoub Meaning
source: In Emirati terms, “Arqoub” is a high sand plateau.
ar: باللهجة الإماراتية، العرقوب هو هضبة رملية مرتفعة.

source: Built with love <3
ar: صنع بحب 3>

source: But instead of using these choices, I decided to just straight up program it, although it's my first time joining the challenge.
ar: ولكن بدلا من استخدام هذه الخيارات، قررت برمجتها مباشرة، على الرغم من أنها المرة الأولى التي أنضم فيها إلى التحدي.

# chivalry
source: Chivalry and Integrity
ar: المروءة والشهامة

# chivalrydesc
source: The principles of chivalry and integrity in Emirati San‘ are closely linked to other values. A person who embodies one of these principles naturally develops the others as well. Chivalry and integrity strengthen social bonds and foster community cooperation in the UAE, encouraging people to help others instinctively without hesitation. These values are deeply connected to generosity and solidarity, and they also teach essential principles of respecting women, regardless of their age or appearance.
ar: وثيقًا، فمن يتمتع بإحدى هذه المبادئ تتولد لديه باقي المبادئ تلقائيًّا، والمروءة والشهامة تزيدان من الترابط الاجتماعي والتعاون المجتمعي في الإمارات، والتي تدفع الناس بدورها لمساعدة الغير تلقائيًا دون أي تفكير، وهي ترتبط ارتباطًا وثيقًا بالكرم والفزعة، إضافة إلى أنّها تُعلّم العديد من مبادئ احترام المرأة أيًّا كان عمرها ومظهرها.

source: Credits
ar: الاعتمادات

# eoe
source: Go to Settings > Apps > iEmirati > Language, and choose the language you want!
ar: انتقل إلى الإعدادات > التطبيقات > iEmirati > اللغة، واختر اللغة التي تريدها!

source: Example: %@
ar: مثال: %@

# exp2020
source: Expo City Dubai
ar: مدينة إكسبو دبي

# exp2020desc
source: Originally known as Expo 2020 Dubai. Expo 2020 Dubai was a world exposition held from October 1, 2021, to March 31, 2022, in Dubai South, near Al Maktoum International Airport. Built between 2016 and 2019, it covered 4.38 sq km and featured 192 pavilions. Its centerpiece, Al Wasl Plaza, housed a 67.5-meter-wide gold trellis dome, inspired by the Ghaf tree’s roots, serving as the world’s largest 360-degree projection screen. Now known as Expo City Dubai, it remains a hub for innovation and culture.
ar: عُرف في الأصل باسم إكسبو 2020 دبي. كان إكسبو 2020 دبي معرضًا عالميًا أقيم من 1 أكتوبر 2021 إلى 31 مارس 2022 في دبي الجنوب، بالقرب من مطار آل مكتوم الدولي. بُني بين 2016 و2019 على مساحة 4.38 كيلومتر مربع، وضم 192 جناحًا. تميز مركزه، ساحة الوصل، بقبة ذهبية شبكية بعرض 67.5 مترًا، مستوحاة من جذور شجرة الغاف، وكانت أكبر شاشة عرض بزاوية 360 درجة في العالم. يُعرف الآن باسم مدينة إكسبو دبي، ولا يزال مركزًا للابتكار والثقافة.

source: Explore Locations
ar: اكتشف المواقع

# expoquest1
source: Explore the heart of Expo City, Al Wasl Plaza
ar: اكتشف قلب مدينة إكسبو، ساحة الوصل

# expoquest2
source: Check out the UAE Pavilion (if it’s still there)
ar: تفقد جناح الإمارات (إذا كان موجودًا)

source: for encouraging me to make this app
ar: لتشجيعي على إنشاء هذا التطبيق

source: for helping me with their wonderful ideas
ar: لمساعدتي بأفكارهم الرائعة

source: for supporting my work
ar: لدعم عملي

source: for testing the app
ar: لتجربة التطبيق

source: Get Started
ar: ابدأ الآن

source: GitHub Repo
ar: موقع GitHub

# Harees
source: Harees (هريس)
ar: هريس

# Harees Description
source: This food is similar to porridge. But, it’s not anything like porridge. It’s made of wheat grain, meat, and ghee, all mashed up in one dish.
ar: هذا الطعام مشابه للعصيدة. لكنه ليس مثل العصيدة. إنه مصنوع من حبوب القمح واللحوم والسمن، وكلها مهروسة في طبق واحد.

# he has no GitHub account :(
source: also known as khamisalali on GitHub
ar: يعرف أيضا باسم khamisalali على GitHub

# hervill
source: Emirates Heritage Village
ar: القرية التراثية

# hervilldesc
source: This place is just a reconstruction of a traditional desert village with a regular roster of events & exhibitions. Built in 2001.
ar: هذا المكان هو مجرد إعادة بناء لقرية صحراوية تقليدية مع قائمة منتظمة من الأحداث والمعارض. تم بناؤه في عام 2001.

source: Home
ar: الصفحة الرئيسية

# hosnquest1
source: Explore the inner fort
ar: استكشف الحصن الداخلي

# hosnquest2
source: Check out the Cultural Foundation building
ar: استكشف المجمع الثقافي

source: Hospitality
ar: حسن الضيافة

# hospitalitydesc
source: Generosity and hospitality are among the customs and traditions associated with Arabs. Hosting guests is one of the fundamental principles of etiquette, which is an integral part of the nation’s deep-rooted culture. It teaches Emiratis the art of hospitality, beginning with the proper serving of Arabic coffee—a tradition in its own right. Guests are welcomed with pre-prepared Arabic coffee, accompanied by warm greetings and expressions of welcome, creating an atmosphere of joy and cheer. The hospitality is then completed by inviting the guest to a meal, as Emiratis are well known for their generosity and hospitality.
ar: يعد الكرم وحسن الضيافة من العادات والتقاليد المرتبطة بالعرب، إذ يُعدّ استقبال الضيف من مبادئ السنع الإماراتي التي تعد جزءًا من الثقافة الأصيلة والمتجذرة في هذه الدولة، كما أنّها تُعلّم الإنسان الإماراتي طرق حسن الضيافة، والتي تبدأ بحسن تقديم القهوة العربية التي تُعدّ تراثًا قائمًا بحد ذاته، حيث يُستقبل الضيف بالقهوة العربية المُحضّرة مسبقًا متبوعةً بعبارات الترحيب والتأهيل؛ الأمر الذي يُعطي جوًا من السعادة والبهجة، وانتهاءً بدعوته على الطعام؛ فالشعب الإماراتي معروف عنه بأنّه شعب كريم ومضياف.

source: How it's played:
ar: طريقة اللعب:

# hvillquest1
source: Discover artifacts
ar: اكتشف القطع الأثرية

# hvillquest2
source: Watch artisans make pottery, blow glass and weave fabric on a loom
ar: شاهد الحرفيين يصنعون الفخار، ينفخون الزجاج، وينسجون القماش على السدو

# iCloud Sync
source: That’s it!
ar: هذا كل شيء!

# jubailmang
source: Jubail Mangrove Park
ar: حديقة قرم الجبيل

# jubailmangdesc
source: This is Abu Dhabi’s first educational, nature, and leisure destination, focusing on mangrove conservation and biodiversity support.
ar: هذه هي الوجهة التعليمية والطبيعية والترفيهية الأولى في أبو ظبي، مع التركيز على الحفاظ على أشجار القرم ودعم التنوع البيولوجي.

# jubailquest1
source: Walk in the Mangrove forests
ar: امش في غابات القرم

# jubailquest2
source: Bird watching
ar: شاهد الطيور

source: Khamis Matter
ar: خميس مطر

# khobzrigag
source: Khobz Riqaq (خبز رقاق)
ar: خبز رقاق

# khobzrigagdesc
source: This game is limited to boys only and is played in the summer in open areas or on the shores of the sea. The game is named after Al-Riqaq, a type of light bread, because the hand movements in the game are similar to the way the dough for riqaq is kneaded. It’s a group game that requires high physical fitness and was often played in neighborhoods, in front of houses, or inside the courtyards of homes.
ar: هذه اللعبة تقتصر على الأولاد فقط تمارس هذه اللعبة في فصل الصيف في المناطق المفتوحة أو على سواحل البحر الرقاق نوع من أنواع الخبز الخفيف سمت هذه اللعبة بهذا الاسم لان طريقة يد اللعب تكون نفس طريقة عجن الرقاق. هي لعبة جماعية تعتمد على اللياقة البدنية العالية ، وكانت تلعب بالأحياء وأمام المنازل أو داخل أحواش المنازل.

# khobzrigaghowtoplay
source: This game requires a wide area, and its duration depends on the number of players. The game is named after Al-Riqaq, a type of thin bread, because it was sold two loaves for one Biza. The Biza was an Indian currency used in the Gulf countries during the 1940s. The game begins after a draw among the players. The one chosen draws a line to mark the starting point for jumping. The players then line up straight behind the starting line, one after another. The player selected for the role bends his body as if bowing during prayer, lowering his head slightly. The other players then jump over him, placing their hands on his back to help them leap. The player who jumps over the back of the one chosen returns to the starting line, according to their turn. The game continues until someone makes a mistake, and that player takes the position of the one who started the game. A mistake is counted if a player touches the head of the player acting as the “hole” (the one on whom the turn falls), pushes them with their leg, fails to jump, or falls to the ground. The game continues until the players call for the end, and throughout the game, the players chant the rhyme: ‘Khubz Riqaq Hantein Biza… Khubz Riqaq Hantein Biza.’
ar: تحتاج هذه اللعبة إلى أرض واسعة ويطول وقت هذه اللعبة تبعاً لعدد اللاعبين وسميت اللعبة بهذا الاسم نسبة إلى الخبز الرقيق والمسمى خبز"الرقاق" حيث كانت تباع كل خبزتين ببيزة. والبيزة عملة هندية كانت تستعمل بدول الخليج خلال فترة الأربعينات. وتبدأ اللعبة بعد إجراء القرعة بين اللاعبين والذي يقع عليه الدور يقوم برسم خط لبداية القفز ثم يقوم اللاعبون خلف خط البداية بشكل مستقيم الواحد تلو الأخر، وبعد ذلك يقوم اللاعب الذي وقعت عليه القرعة بثني جسمه كما في الركوع أثناء الصلاة وينزل من رأسه قليلاً ثم يبدأ اللاعبون بالقفز من فوقه ويحق لكل لاعب أن يضع يديه فوق ظهر لاعب "الهول" – من عليه الدور- ليتم عملية القفز، والذي يقفز من فوق ظهره يعود لخط البداية حسب دوره بين اللاعبين ، وهكذا إلى أن يخطئ أحدهم فيقف مكان اللاعب الذي بدأ اللعبة ، ويحتسب الخطأ إذا لمس اللاعب برأس لاعب الهول أو أن يدفعه برجله أو في حاله عدم استطاعته القفز أو وقوعه على الأرض ، وتستمر هذه اللعبة إلى أن يردد اللاعبون نهايتها ، وطوال اللعب يردد اللاعبون أهزوجة : خبز رقاق هنتين ببيزة .. خبز رقاق هنتين ببيزة .

# Khor
source: خور (Khor)
ar: خور

# Khor Example
source: “Yadaft bil qareb fil Khor”, which means “I rowed a boat in the bay.”
ar: “جدفت بالقارب في الخور”

# Khor Meaning
source: It’s a place where water flows into the sea, a low-lying area between two elevations, or a bay.
ar: هو مصب ماء في البحر، أو منخفض من الأرض بين مرتفعين، أو خليج.

# Luqaimat
source: Luqaimat (لقيمات)
ar: لقيمات

# Luqaimat Description
source: It's everyone's favorite. It's usually coated in date molasses, or honey. Some people like to have it injected with cheese or Nutella.
ar: إنه المفضل لدى الجميع. عادة ما يكون مغطى بدبس التمر، أو العسل. يحب بعض الناس حقنه بالجبن أو نوتيلا.

# Machboos
source: Machboos (مجبوس)
ar: مجبوس

# Machboos Description
source: This tasty mixture of rice, cumin, salt, black pepper, turmeric, dried leaves and dried lime, always goes well with your choice of meat.
ar: هذا المزيج اللذيذ من الأرز والكمون والملح والفلفل الأسود والكركم والأوراق المجففة والليمون المجفف، يتناسب دائما مع اختيارك من اللحوم.

source: May the best prototype win!
ar: أتمنى أن يفوز أفضل نموذج أولي!

source: Mayed AlKaabi
ar: مايد الكعبي

source: Meaning: %@
ar: المعنى: %@

source: More
ar: المزيد

source: My Family
ar: عائلتي

source: My Friends
ar: أصدقائي

source: My Teachers
ar: أساتذتي

# onboardingremind
source: Want it in Arabic?
ar: تريده باللغة الانجليزية؟

source: Open in Google Maps
ar: افتح في خرائط جوجل

source: Open in Safari
ar: افتح في سفاري

source: Open in  Maps
ar: افتح في خرائط آبل

source: Saeed Yasser
ar: سعيد ياسر

# sincerity
source: Loyalty, Honesty, and Truthfulness
ar: الإخلاص والأمانة والصدق

# sinceritydesc
source: One of the several noble qualities in the UAE include loyalty, which extends to all aspects of life—such as loyalty in work, to family, and to friends. This is alongside honesty and truthfulness. This principle has been incorporated into Emirati San‘ as a fundamental value that every Emirati should uphold in loving their homeland, defending it sincerely, and protecting it with courage and strength.
ar: تنحدر لدى من لديه السنع الإماراتي عدّة صفات حميدة، منها: الإخلاص، ويشمل ذلك الإخلاص في جميع شؤون الحياة؛ كالإخلاص في العمل، والإخلاص للعائلة والأصدقاء وغيرها، إلى جانب الأمانة والصدق، وقد أُضيف هذا المبدأ إلى السنع الإماراتي ليكون مبدأً يجب على الإماراتي التحلّي به في محبّة وطنه، والدفاع الصادق عنه، والإخلاص في حبه، وحمايته بشجاعة وبأس.

source: Special thanks to:
ar: شكر خاص إلى:

# splash1
source: Welcome to
ar: حياك في تطبيق

source: Swipe to learn more >>>
ar: اسحب لتتعلم المزيد >>>

source: Tap to learn more!
ar: اضغط لتتعلم المزيد!

source: Tap to learn the meaning!
ar: اضغط لتتعلم المعنى!

source: Tap to view
ar: اضغط للعرض

source: Teammates/Contributors:
ar: زملاء الفريق/المساهمون:

# teela
source: Teela (تيلة)
ar: تيلة

# teeladesc
source: A game played in groups in an open courtyard, where players try to knock out their opponents' marbles.
ar: لعبة تُلعب في مجموعات في ساحة مفتوحة، حيث يحاول اللاعبون إخراج كرات خصومهم.

# teelarules
source: It’s typically played by 2-4 players. You’ll need a flat surface, marbles, and a circle or a drawn-out playing area where marbles can be flicked or thrown. One marble is typically used as a “shooter.” Players take turns flicking or shooting marbles (using their thumb or another finger) into the circle or at other marbles. The objective is to hit or knock out marbles from the circle while keeping your shooter in play. Players may score points based on how many marbles they can get into the circle or by knocking out the marbles of others. The winner is usually the player who collects the most marbles or completes a specific objective (e.g., knocking out all opponent marbles or landing a marble in a specific spot).
ar: يتم لعبها عادة من قبل 2 إلى 4 لاعبين. ستحتاج إلى سطح مستوٍ، كرات زجاجية، ودائرة أو مساحة مرسومة حيث يمكن رمي أو قذف الكرات. عادةً ما يُستخدم كرة واحدة كـ “رماية”. يتناوب اللاعبون في قذف أو رمي الكرات (باستخدام الإبهام أو إصبع آخر) إلى الدائرة أو نحو كرات أخرى. الهدف هو ضرب أو إخراج الكرات من الدائرة مع الحفاظ على كرة الرماية داخل اللعبة. قد يحصل اللاعبون على نقاط بناءً على عدد الكرات التي يمكنهم إدخالها في الدائرة أو من خلال إخراج كرات الآخرين. عادةً ما يكون الفائز هو اللاعب الذي يجمع أكبر عدد من الكرات أو يحقق هدفًا محددًا (مثل إخراج جميع كرات الخصم أو إدخال كرة في مكان معين).

# That feature is coming soon!
source: Go ahead and try the app!
ar: تفضل وجرب التطبيق!

source: The app isn't complete yet, there's still more to work on!
ar: لم يتم تكملة التطبيق، لا يزال هناك الكثير للقيام به!

source: The Story
ar: قصة التطبيق

source: Things to do:
ar: أشياء للقيام بها:

source: This app is in beta
ar: هذا التطبيق تجريبي

source: This app was made for the iOS Design Challenge 2024-2025. The theme was "UAE National Identity".
ar: تم تصميم هذا التطبيق لتحدي تصميم iOS 2024-2025. كان الموضوع "الهوية الوطنية الإماراتية".

source: Tolerance
ar: التسامح

# tolerancedesc
source: The most significant value of the UAE is tolerance and respect for all people, regardless of their color, gender, race, or religion. This is a value that everyone should uphold, especially since the UAE serves as a gateway that brings together people of diverse backgrounds from all over the world. This tolerance reflects the nation’s deep-rooted values and openness, which are embodied by its people. Moreover, tolerance has numerous positive effects on both individuals and society, as it strengthens social cohesion and positively influences people’s behavior in their daily lives.
ar: يعلم السنع الإماراتي العديد من المبادئ أهمها التسامح واحترام الجميع بغض النظر عن لونه وجنسه وعرقه ودينه، وهو الأمر الذي يجب على جميع الناس التحلي به؛ نظرًا لأنّ دولة الإمارات تُعدّ بوابة تضم في داخلها العديد من الأعراق من مختلف أنحاء العالم، وهذا التسامح يعكس القيم المتجذرة والانفتاح الذي يتمثّل به أبناؤها، وللتسامح آثار عديدة تنعكس على الفرد والمجتمع، فهو يساعد على زيادة الترابط المجتمعي وينعكس على سلوكيات أفراده في الحياة اليومية.

source: Traditional Foods
ar: الأكلات الشعبية

source: Traditional Games
ar: الألعاب الشعبية

source: Values
ar: السنع

source: Values of the UAE
ar: السنع في الإمارات

source: Version: %@
ar: الإصدار: %@

source: We were told to create an app prototype via either Keynote or Figma, that captures the essence of UAE National Identity, focusing on Heritage and Values - the core of what it means to be Emirati and part of the UAE.
ar: طلب منا إنشاء نموذج أولي للتطبيق عبر Keynote أو Figma، والذي يجسد جوهر الهوية الوطنية الإماراتية، مع التركيز على التراث والقيم - جوهر ما يعنيه أن تكون إماراتيا وجزءا من دولة الإمارات العربية المتحدة.

source: Welcome to iEmirati!
ar: حياك في تطبيق iEmirati!

source: What's this..?
ar: ما هذا..؟

source: Word of the Day
ar: كلمة اليوم

source: You!
ar: أنت!

source: Yousef Alkhemeiri
ar: يوسف الخميري
